# FahrenheitInterval Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..FahrenheitInterval Property
UnitTypeId Class See Also
---
Fahrenheit interval.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId FahrenheitInterval { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FahrenheitInterval As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FahrenheitInterval {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace